app/views/lists/show.html.erb

<h1><%=@list.name%> - <%= pluralize(@list.movies.size, 'movie')%> </h1>
<%= link_to "Add a bookmark", new_list_bookmark_path(@list), class: "btn btn-flat"%>
<%@list.movies.each do |movie|%>
<h2><%= movie.title%></h2>
<p><%movie.bookmarks.each do |i|%><%= i.comment%><%end%></p>
---
SELECT "movies"."id" FROM "movies" INNER JOIN "bookmarks" ON "movies"."id" = "bookmarks"."movie_id" WHERE "bookmarks"."list_id" = $1  [["list_id", 7]]
SELECT COUNT(*) FROM "movies" INNER JOIN "bookmarks" ON "movies"."id" = "bookmarks"."movie_id" WHERE "bookmarks"."list_id" = $1  [["list_id", 8]]
SELECT "movies".* FROM "movies" INNER JOIN "bookmarks" ON "movies"."id" = "bookmarks"."movie_id" WHERE "bookmarks"."list_id" = $1  [["list_id", 10]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."movie_id" = $1  [["movie_id", 2]]