app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Romantic Movies"], ["created_at", "2022-03-26 19:13:45.987284"], ["updated_at", "2022-03-26 19:13:45.987284"]]
---
  def create
    @list = List.new(list_params)
    if @list.save